{
  "town": {
    "name": "Dark Reef",
    "locations": [
      "harbor",
      "bar",
      "cemetery",
      "inn",
      "clinic",
      "restaurant"
    ],
    "description": "The central area for the pirate town of Dark Reef"
  },
  "harbor": {
    "name": "Dark Reef Port",
    "description": "A messy, yet beautiful harbor. The BlackDragoon is docked and chilling.",
    "locations": [
      "bar",
      "cemetery",
      "inn",
      "clinic",
      "restaurant",
      "town"
    ]
  },
  "bar": {
    "name": "The Ugly Duckling",
    "locations": [
      "harbor",
      "cemetery",
      "inn",
      "clinic",
      "restaurant",
      "town"
    ],
    "description": "A sign labeled \"The Ugly Duckling\" hangs from rusty chains outside of what looks to be a popular bar location. \nThe door is heavy as you pull it open and are greeted by a cozy little pirate bar.\nThere is a bartender, a lone stranger sitting in the corner, and the smell of ale permeates the area."
  },
  "cemetery": {
    "name": "Fair Winds and Following Seas Cemetery",
    "locations": [
      "crypt",
      "bar",
      "inn",
      "clinic",
      "restaurant",
      "town"
    ],
    "description": "A cemetery that has a mourner crying over a gravestone, a shovel leaning against a cabin, and a nearby crypt with what appears to be an open door."
  },
  "crypt": {
    "name": "Ryte Family Tomb",
    "locations": [
      "cemetery",
      "town"
    ],
    "description": "You walk through a stone door to a mausoleum. A musty air hangs around and the feeling you're not alone..."
  },
  "inn": {
    "name": "The Shallow Deep",
    "locations": [
      "harbor",
      "cemetery",
      "bar",
      "clinic",
      "town"
    ],
    "description": "As you walk inside the inn you notice a three-headed dog wagging his tail right outside. \n\nYou proceed inside the Shallow Deep inn.\nNot very active this time of day, you notice only an Innkeeper, and a pirate with an eye-patch.\nThe innkeeper looks rather similar to the dog outside and the pirate looks very old."
  },
  "clinic": {
    "name": "Seaview Clinic",
    "locations": [
      "harbor",
      "cemetery",
      "bar",
      "inn",
      "restaurant",
      "town"
    ],
    "description": "You walk inside what appears to be the only clinic in town and notice three people.\nA receptionist behind a desk, and two people behind her.\nOne much older and you realize that this must be the town doctor. \nThe other is much younger and appears to be helping the older man, you deduced that this must be an apprentice."
  },
  "restaurant": {
    "name": "Dirty Sea Dogs",
    "locations": [
      "harbor",
      "cemetery",
      "bar",
      "clinic",
      "inn",
      "town"
    ],
    "description": "First thing you noticed as you approach the Dirty Sea Dogs restaurant is the food safety grade of 'D' on the front window. You think to yourself that, they certainly live up to their name. As you walk in, you see the cook and she motions you to sit on an empty table."
  },
  "island": {
    "name": "Yarginory Island",
    "description": "After sailing to where your navigator directed, you spot a beautiful, yet creepy little island off in the distance. \n"
  }
}